Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Properties
The SpiralBeam type exposes the following members.
Properties
Name | Description
AssemblyNumber
 Gets or sets the assembly number. Defines the numbering in the assembly sense.
 (Inherited from Part.)
CastUnitType
 Gets or sets the cast unit type of the part.
 (Inherited from Part.)
Class
 Gets or sets the class of the part.
 (Inherited from Part.)
DeformingData
 Gets or sets the deforming data of the part.
 (Inherited from Part.)
EndPoint
 Gets the spiral beam end point.
Finish
 Gets or sets the finish of the part.
 (Inherited from Part.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Material
 Gets or sets the material the part is made of.
 (Inherited from Part.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the part.
 (Inherited from Part.)
PartNumber
 Gets or sets the part number. Defines the numbering in the part sense.
 (Inherited from Part.)
Position
 Gets or sets the part position. Defines the way the part is positioned in the model.
 (Inherited from Part.)
PourPhase
 Gets or sets the pour phase of the part.
 (Inherited from Part.)
Profile
 Gets or sets the profile of the part.
 (Inherited from Part.)
RotationAngle
 Gets or sets the rotation of the spiral beam in degrees. Each range of 360.0 degrees adds a full rotation.
RotationAxisBasePoint
 Gets or sets the first definition point of the spiral beam rotation axis.
RotationAxisDirection
 Gets the direction of the spiral beam rotation axis.
RotationAxisUpPoint
 Gets or sets the second definition point of the spiral beam rotation axis.
RotationCenterPoint
 Gets the geometric rotation center point at the start of the spiral beam.
StartPoint
 Gets or sets the start point of the spiral beam.
TotalRise
 Gets or sets the difference between the spiral beam start and end point in the direction of the rotation axis.
TwistAngleEnd
 Gets or sets the twist angle in degrees at the end of the spiral beam.
TwistAngleStart
 Gets or sets the twist angle in degrees at the start of the spiral beam.
Top
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace